Autodesk.Revit.DB.SolidOrShellTessellationControls.DisableLevelOfDetail
Disables the use of levelOfDetail. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input).
Since:
2013

Autodesk.Revit.DB.SolidOrShellTessellationControls.UseLevelOfDetail
Returns true if the use of levelOfDetail is enabled, false if not. The use of levelOfDetail is enabled
by calling setLevelOfDetail (with a valid input).
Since:
2013

Autodesk.Revit.DB.SolidOrShellTessellationControls.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SolidOrShellTessellationControls.LevelOfDetail
An number between 0 and 1 (inclusive) specifying the level of detail for the triangulation of a solid or shell.
Remarks:
Smaller values yield coarser triangulations (fewer triangles), while larger values yield finer
triangulations (more triangles).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for levelOfDetail must lie between 0 and 1 (inclusive).
Since:
2013

Autodesk.Revit.DB.SolidOrShellTessellationControls.MinAngleInTriangle
A non-negative real number specifying the minimum allowed angle for any triangle in the triangulation, in radians.
Remarks:
A small value can be useful when triangulating long, thin objects, in order to keep the number of triangles
small, but it can result in long, thin triangles, which are not acceptable for all applications. If the value
is too large, this constraint may not be satisfiable, causing the triangulation to fail. This constraint may be
approximately enforced. A value of 0 means to ignore the minimum angle constraint.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for minAngleInTriangle must be at least 0 and less than 60 degrees, expressed in radians. The value 0 means to ignore the minimum angle constraint.
Since:
2013

Autodesk.Revit.DB.SolidOrShellTessellationControls.MinExternalAngleBetweenTriangles
A positive real number specifying the minimum allowed value for the external angle between two adjacent triangles, in radians.
Remarks:
A small value yields more smoothly curved triangulated surfaces, usually at the expense of an increase in the
number of triangles. Note that this setting has no effect for planar surfaces. This constraint may be approximately
enforced.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for minExternalAngleBetweenTriangles must be greater than 0 and no more than 30000 feet.
Since:
2013

Autodesk.Revit.DB.SolidOrShellTessellationControls.Accuracy
A positive real number specifying how accurately a triangulation should approximate a solid or shell.
Remarks:
The maximum distance from a point on the triangulation to the nearest point on the solid or shell should
be no greater than the specified accuracy. This constraint may be approximately enforced.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for accuracy must be greater than 0 and no more than 30000 feet.
Since:
2013

Autodesk.Revit.DB.SolidOrShellTessellationControls.#ctor
Default constructor.
Since:
2013

Autodesk.Revit.DB.SolidOrShellTessellationControls
Controls various aspects of the triangulation produced by SolutUtils::tessellateSolidOrShell.
Since:
2013